import java.time.LocalDateTime;

/**
 * Java_program_01
 * 
 * Настроить проект, вывести в консоль “Hello world!”.
 *Вывести в консоль системные дату и время.

 */
public class Task1 {
    public static void main(String[] args) {
        System.out.println(LocalDateTime.now());
    }
    
}